# Задача 2: створити модуль, котрий:
# 1. Виводить на екран повідомлення виду "це модуль для перетворення рядків у uppercase і lowercase"
# 2. Тримає в собі дві функції: upper і lower, котрі приймають в себе рядок і видають рядок  у відповідному кейсі
# 3. Якщо він викликаний незалежно (а не в імпорті), він виводить ваше ім'я в lowercase і uppercase.


# Приклад оголошення функцій буде надано нижче. Треба буде виключно створити їхню імплементацію.
# Можна використовувати вбудовані функції, але краще використати таблицю ASCII :)
# В рамках задачі можемо обмежитися словами з символами виключно з латинського алфавіту.

def lower(string):
    """Функція, котра переводить рядок string у lowercase"""
    #Here goes your implementation
    return result

def upper(string):
    """Функція, котра переводить рядок string у uppercase"""
    #here goes your implementation
    return result
