# Задача 2: валідатор пароля.
#
# Написати консольний застосунок, що приймає на вхід два рядки:
#
#     Пароль
#     Пароль повторно
#
# І перевіряє наступне:
#
#     Рівність рядків між собою
#     Довжину пароля (не менше 8 символів)
#     Наявність як великих, так і малих літер
#     Наявність цифр
#     Наявність спецсимволів (не алфавітних або числових)
#
# У випадку не проходження однієї з перевірок програма має заново запитати пароль у користувача. Програма має завершити роботу одразу після введення валідного пароля двічі.

