# Задача 3: простий консольний калькулятор¶
#
# Написати консольний застосунок, що приймає на вхід дві команди:
#
#     calculate
#     end
#
# У випадку команди calculate, застосунок має проінструктувати користувача, що йому треба ввести послідовно два числа та одну з дозволених бінарних арифметичних операцій.
#
# У випадку введення невалідних чисел чи операторів, треба вивести повідомлення про помилку і попросити користувача ввести операнди та оператор заново.
#
# Після вводу операндів і оператору, треба вивести результат. Після виведення результату програма має запитувати наступну команду від користувача. У випадку команди end програма має завершувати роботу.
#
# Програма приймає на вхід виключно цілі числа.
#
# P.S. До речі, подібний підхід до запису арифметичних виразів (оператор після операндів) називається зворотна польська нотація.

