### Задача 1: таблиця ASCII і конвертація рядків за її допомогою.

# Цифри, літери латинського алфавіту і деякі спеціальні символи ($, @, \n, \t тощо) традиційно представляються в пам'яті комп'ютера згідно [таблиці ASCII](https://www.ascii-codes.com/cp855.html). В стандартній таблиці ASCII представлено 128 символі (2**8). В сучасному світі таблиця ASCII замінена на Unicode для репрезентації більш широкого спектру символів (кирилічний алфавіт, грецький алфавіт, різні спецсимволи, емоджи тощо). Але всі коди в ASCII входять у Unicode незмінно (тобто, Unicode є надмножиною для ASCII). Більше про різницю між ними [тут](https://www.javatpoint.com/ascii-vs-unicode).
#
# В Python ASCII/Unicode-код символа може бути отриманий за допомогою функції ord(). І, натомість, в Python ми можемо отримати символ за його ASCII/Unicode номером за допомогою вбудованої функції chr().
#
# Знаючи це, створіть три окремі рядки:
# 1. Входящий рядок, переведений у Upper Case
# 2. Входящий рядок, переведений у Lower Case
# 3. Входящий рядок, переведений у один рядок (без символів кінця рядку)
#
# і виведіть результат.
# Робити це треба виключно використовуючи таблицю ASCII. Всі символи, що відрізняються від латинського алфавіту, мають бути збережені без змін.

input_str = """Hello! My name is Ілля!
My email is illya.khoroshykh@gmail.com. I have 10$ in my pocket. 
& wut 'bout u?'"""
