# Задача 4: генерація випадкових дат.
#
# В Python існує безліч зручних вбудованих модулей. Наразі, нас цікавлять два: random і datetime.
#
# datetime - модуль, що дозволяє працювати з datetime-об'єктами, використовуючи доволі простий інтерфейс (приклади нижче в коді)
#
# Напишіть програму, котра:
#   Бере сьогоднішню дату
#     Бере випадкове ціле число від 1 до 100
#     Віднімає цю кількість років від поточного року
#     Генерує дату між отриманим на попередньому кроці роком і сьогоднішнім днем
#     Виводить її
#     Виводить різницю між сьогоднішнім днем і випадковою датою.
# Врахуйте, що в різних місяцях різна кількість днів. Якщо, наприклад, ваш код видає щось на кшталт 30 лютого, повторіть випадковий вибір до валідного результату.

# Високосні роки враховуються!


from datetime import datetime, timedelta

today = datetime.today()
print(f"Сьогодні в нас: {today.date()}")
one_day_delta = timedelta(days=1)
yesterday = today - one_day_delta
print(f"Вчора було: {yesterday.date()}")
print(f"Різниця між цими датами: {today - yesterday}")
print(f"Тип об'єкту сьогоднішньої дати: {type(today)}")
print(f"Тип різниці між датами: {type(today - yesterday)}")
