# Задача 2: Зробити програму, що приймає дві команди:
# fac і fib.
# Якщо прийшла команда fac, програма має спитати в користувача число і порахувати його факторіал
# Якщо прийшла команда fib, програма має спитати в користувача число і порахувати відповідне число Фібоначчі
# Програма приймає на вхід тільки цілі числа більше або дорівнюючи нулю. Для цілей задачі можемо не розглядати випадки, коли введено невалідне число чи невалідна команда.
# Бажано створити імплементацію як циклом for, так і циклом while.
