# Задача 3: створення словника з рядку та позицій літер у ньому.
#
# Напишіть програму, шо приймає на вхід рядок і повертає список, формату {індекс в рядку: символ на ньому}

# Зробіть це за допомогою декількох методів (zip, dict comprehension, for loop)


example_str = "Stepan Bandera"

expected_dict = {0: 'S',
                 1: 't',
                 2: 'e',
                 3: 'p',
                 4: 'a',
                 5: 'n',
                 6: ' ',
                 8: 'a',
                 9: 'n',
                 10: 'd',
                 11: 'e',
                 12: 'r',
                 13: 'a'}
