# Задача для роботи в групі:
#
# Уявіть, що у вас є певне сховище JSON-файлів. Ці файли зберігають в собі дані про картинки, зібрані з трьох джерел: Pinterest, GettyImages, Tumblr.
# Вам треба прочитати ці дані та згенерувати з них JSON наступного формату:
#
# {
#     "image_url": some_url,
#     "source": назва джерела
#     "source_metadata": різна метаінформація про джерело (який блог чи яка борда в Пінтересті)
#     "processing_metadata: айді повідомлення, статус код, час обробки
# }
#
# Формат кожного з полів можете вважати довільним.
#
# Для кожного тегу ви маєте збирати максимум до 150 об'єктів подібного формату і потім зберігати їх в директорію з назвою відповідного тегу.
# Кожен файл в кінці має мати в собі максимум 150 об'єктів.
#
# Ви не маєте зберігати повідомлення, якщо його статус код = 404
#
# Розробляйте застосунок таким чином, щоб в будь який момент можна було безболісно додати обробку нового джерела картинок з іншою структурою повідомлень
