# Задача 1.1: конкатенація словників

# Напишіть програму, котра приймає на вхід два словника, заданих через змінні і повертає один словник, що є сумою перших двох

# Якщо в обох словниках повторюються ключі, але їхні величини відрізняються,
# то на місці значення треба створити список усіх значень з обох словників.

# Якщо в обох словниках повторюються ключі та їхні величини, треба залишати одну величину і не створювати список

dict_1 = {"a": 1, "b": 2, "c": 3}
dict_2 = {"b": 2, "c": 4, "d": 5}

expected_dict_1 = {"a": 1, "b": 2, "c": [3, 4], "d": 5}

# Задача 1.1: конкатенація списку словників

# Напишіть програму, котра приймає на вхід список словників і зливає їх в один за правилами, зазначеними вище.

dicts_list = [dict_1, dict_2, {"c": 5, "d": 5, "e": 5}]

expected_dict_2 = {"a": 1, "b": 2, "c": [3, 4, 5], "d": 5, "e": 5}
