# Задача 1. Маніпуляція парами списків.

# Уявимо, що в нас є два списки: list_1 і list_2, що задані в коді змінними
#
# Для кожного з них треба вивести на екран:
# 1. Список list_3 що є відсортованим об'єднанням двох входящих списків
# Наприклад, list_1 = [1,2], list_2 = [4,3]
# list_3 = [1, 2, 3, 4]
# 2. Список cartesian_product що складається з кортежів виду (l1, l2), де l1 - елементи першого списку, l2 - елементи другого.
# Наприклад, list_1 = [1,2], list_2 = [3,4]
# cartesian_product = [(1,3), (1,4), (2,3), (2,4)]
# 3. Список елементів, присутніх у обох списках intersection_list

list_1 = [1, 2, 4, 5]
list_2 = [3, 5, 7, 1]
