#Задача 1.
# Уявимо, що у вас є список довільного ступеню вкладеності (приклад буде наведено нижче).
# Напишіть програму, котра перетворює вкладений список у плаский (тобто, додає вкладені елементи до основного списку).
# Наприклад, програма отримує на вхід input_list = [1, 2, 3, [4, 5, 6, [7]]]
# Результатом її роботи є список output_list = [1, 2, 3, 4, 5, 6, 7]

# Hint: перевірити, чи є об'єкт списком можна викликавши вбудовану функцію isinstance, котра першим аргументом приймає
# об'єкт і другим - конструктор типу.

print(isinstance("a", str))
print(isinstance(["a"], list))

example_input_list = ["a", "b", ["c"], [[["d"]]], ["e", ["f", "g"]]]
